mystr = "Привіт козаки і козачки!"
print(mystr)
#У рядку можна звертатися до окремих символів за індексом 
#індексація у рядку починається з 0
name = "Петро"
# [] - оператор індексації - для звернення до індексу до рядка
print(name[2]) # виведе "т"

#можна змінювати окремі символи рядка по індексу
#name[0] = "C" # помилка, рядкі незмінні

name = "Мальвіна"
print("name = ", name)

# зріз рядка - отримуємо під рядок поточного рядка
print("name[2:4] = ", name[2:4]) # вирізаємо з 2 індекса по 4 індекс не включно
print("name[0:3] = ", name[0:3]) # вирізаємо з 0 по 3 не включно

name = """Аліса в
країні чудес"""

print("name = ", name)

#контонація рядків - обєднання рядків
testStr = "Привіт! " + name # конкотонація рядків за допомогою +
print("testStr = ", testStr)

# інтераці по рядку за допомогою циклу for
print("--- Інтерація у рядку ---")
name = "Василь"
for char in name:
    print(char)

# чи входить рядок у підрядок
print("си" in name) # True - данний підрядок є у рядку
print("ка" in name) # False - діного підрядка немає у рядку

print("---- Довжина рядка ----")
print("len(name) = ", len (name)) # довжина рядка
# upper - перетворення рядка у верхній регістр
# lower - перетворення рядка у нижній регістр
# strip - видалення проюілів на початку і в цінці
# replace - заміна підрядка на інший підрядок
# split - розбиття рядка на список підрядків за роздільником
# join - об'єднання списку рядків у один рядок з роздільником
# find - пошук підрядка у рядку, повертає індекс першого входження або -1 якщо не знайдено
 # startswith - перевірка чи починається рядок з певного підрядка
 # endswith - перевірка чи закінчується рядок певним підрядком