print("Привіт усім!")

# Функція - це іменовий блок коду, який виконує певне завдання.
# Функції допомогають уникати проблеми дублювання коду,
# роблячи код більш організованим і легким для читання.
# Ми можемо оголосити функцію і описати її поведінку.
# Потім викликати її довільку кількість разів у будь-якому місці нашого коду.

# прототип оголшення функції
# def назва_функції():
#     блок_коду_функції

# def - ключове слово для оголошення функції
# назва_функції - ім'я, яке ми даємо нашій функції - 
# не може починатися з цифри, не може містити пробілів, 
# не може бути зарезервованим словом
# Зарезервовані слова - if, else, for, while, def, return
# print - це також зарезервоване слово - це назва вбудованої функції 
#
# Фунція особлива тим, що вана у кінці слова має дужки ()
# У кінці оголошення функції стоїть двокрапка :
# Тіло функції (блок коду функції) - що функція буде виконувати
# має бути відступлено на 4 пробіли або один табулятор

# перед створенням функції визнаємо, що вона має робити
# дайте напишемо функцію, яка буде виводити привітання з днем закоханих

# записуємо функції CamelCase - кожне нове слово з великої літери
def greetValentines():
    print("--Вітаю з Днем Закоханих--!")
    print("++Шукай половинку серця++!")

# Ми створили функцію, яка буде виводити 2 рядка тексту
# Тобто виволить привітання з днеи закоханих
# Як викликати функцію?
#greetValentines() # Викликаю код функції в данному місці функція виконає свій код    

# Тепер викликаємо функцію кілька разів
count = input("Скількі разів вас привітати з Днем закоханих?")
intCount = int(count) # перетворюємо рядок в ціле число
i=0 # лічильник циклу - кожна інтерація збільшує лічильник на 1
while i < intCount:
    greetValentines() # виклик функції
    i += 1 # збільшуємо ліс=чильник на 1
