#Буду робити функцію, яка буде виводите 
#повідомлення певну кількість разів на екран.
# фукнція приймає параметр 1 - це кількість

# countView = кількість - число - ітерації роботи циклу
def myPrintCount(countView): # myPrintCount - назва функції
    if countView<0:
        print("Не допустиме значення кількості ", countView)
        return # вихід із функції - це ключове слова
    i = 0 # кількість ітерацій циклу
    while(i!=countView): # працює до не дійде до countView = 5 5!=5
        print("Обідати")
        i=i+1 # Збільшуємо лічильник циклу

myPrintCount(4)
