# Функція приймає 2 параметри
# 1 - параметер - кількість разів
# 2 - параметер - текст який виводимо
# коли виводимо на екран формат виводу має бути такий
# 1 - ТЕКСТ
# 2 - ТЕКСТ
# n - ТЕКСТ
# Якщо 1 параметр менший 0, то нічого не робимоі

def myViewSalo():
    countTry = 3 # кількіть спроб
    myText = "Сало"

    i=0 # лічильник циклу
    while i<countTry:
        print(f"{i+1} - {myText}")
        i+=1

count = input("Вкажіть кількість ->_")
text = ("Вкажіть повідомлення ->_")
# myViewSalo(2,"Слава Україні")
myViewSalo(int(count), text)