# Діапазо значень
start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))
print(f"Числа від {start} до {end}:")
i = start # лічильник циклу
while i <= end:
    print(i, end=' ')
    i += 1 # крок ітерації діапазону
print() # для переходу на новий рядок після виведення діапазону

# Діапазо значень
start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))
print(f"Числа від {start} до {end}:")
i = start # лічильник циклу
while i <= end:
    print(i, end=' ')
    i += 1 # крок ітерації діапазону
print() # для переходу на новий рядок після виведення діапазону

