print("---Робота із списками в Python---") # Виводимо текст на екран

myList = [12, 18, 33, 22]          # Створили перший лист з цілими числами, а потім вивели їх на екран
print("Початковий список:", myList)


mixedList = [12, "Hello", 45.6, True]               # Створили список з різними типами данних та вивели його на екран
print("Список з різними типами даних:", mixedList)


print("Перший елемент списку myList:", myList[0])  # Виводимо перший елемент коду - 12(начинаємо рахувати з 0)

myList[0] = "Сало"      # Замінили 12 на "Сало" і вивели на екран

print("Змінений список myList:", myList)

myList.append(29)       # Додали новий елемент (29) завдяки .append, та вивели на екран
print("Список myList після додавання нового елемента 29:", myList)

cats = ["Мурка", "Барсик", "Васька"]    # Створили новий список з котами
print("Список котів:", cats)

myList.extend(cats)         # Додали новий список (cats) до минулого списку (myList) завдяки .extend
print("myList після додавання списку котів:", myList)

del myList[0]       # Видалели перший елемент (myList[0]) завдяки del
print("myList після видалення першого елемента:", myList)

myList.append(['ss', 'ee'])         # Додали новий елемент списку
print("myList після додавання нового елемента-списку:", myList)

print("Довжина myList:", len(myList)) # Вивели кількість елементів списку за допомогою len(mylist)
                                      # Елементів 8 томущо ['ss', 'ee'] рахується за один елемент

myList.extend([100, 200, 300])  # Використали .extend для додавання зразу 3 елементів
                                # Томущо .append можу додати тільки 1 елемент
print("myList після додавання ще трьох елементів:", myList)
