a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))
choise = (input("Виберіть операцюя яку потрібно виконати: //, **, %, +=, -=, *=, /=, //=, **=, %=  \n"))
if choise == "//":
    c = a // b
    print(f"{a} // {b} = {c}")
elif choise == "**":
    c = a ** b
    print(f"{a} ** {b} = {c}")    
elif choise == "+=":
    print(f"a += b, це те саме що a = a + b, тобто a і b додається і зберігається у пам'яті: {a} += {b}, {a} = {a} + {b}")
elif choise == "-=":
    print(f"a -= b, це те саме що a = a - b, тобто a і b віднімається і зберігається у пам'яті: {a} -= {b}, {a} = {a} - {b}")
elif choise == "*=":
    print(f"a *= b, це те саме що a = a * b, тобто a і b множаться і зберігається у пам'яті: {a} *= {b}, {a} = {a} * {b}") 
elif choise == "/=":
    print(f"a /= b, це те саме що a = a / b, тобто a і b діляться і зберігається у пам'яті: {a} /= {b}, {a} = {a} / {b}") 
elif choise == "//=":
    print(f"a //= b, це те саме що a = a // b, тобто a і b діляться і відкідається дообовачастина і зберігається у пам'яті: {a} //= {b}, {a} = {a} // {b}")                    
elif choise == "**=":
    print(f"a **= b, це те саме що a = a ** b, тобто a і b підносяться до степеня і зберігається у пам'яті: {a} **= {b}, {a} = {a} ** {b}")   
elif choise == "%=":
    print(f"a %= b, це те саме що a = a % b, тобто виконується функція остача від ділення між числами a і b, та зберігається у пам'яті: {a} %= {b}, {a} = {a} % {b}")
else:
    print("Виберіть одну дію з наведених вище")          