print("Оператор break та continue")
# break — перериває роботу циклу
# continue — повертає цикл до перевірки умови

count = 0

print("Вводь вік учнів по одному.")
print("Для завершення введи -1")

while True:
    age = int(input("Введіть вік учня: "))

    if age == -1:
        print("Введення завершено")
        break

    if age > 100:
        print("Програма стикнулася із критичною помилкою! Робота неможлива")
        break

    if age < 18:
        count += 1
    else:
        continue  # якщо не учень школи — пропускаємо вивід нижче

    print(f"Дитині зараз {age}, до повноліття лишилося {18 - age}")

print("Кількість дітей школи:", count)
