try:
    # Пробуємо виконати код, у якому може виникнути помилка
    a = int(input("Введіть перше число: "))  # Якщо введуть текст → буде ValueError
    b = int(input("Введіть друге число: "))
    
    result = a / b  # Якщо b = 0 → буде ZeroDivisionError
    print("Результат:", result)

except ValueError:
    # Потрібно, щоб програма не зламалась,
    # якщо користувач введе не число
    print("Помилка! Ви ввели не число.")

except ZeroDivisionError:
    # Потрібно, щоб уникнути аварійного завершення програми
    # при спробі ділення на нуль
    print("Помилка! Не можна ділити на нуль.")

finally:
    # Цей блок виконується завжди.
    # Використовується для завершальних дій (наприклад, закриття файлів).
    print("Програма завершена.")
